---
title: "Crónica de una reinstalación de Windows"
date: 2003-09-26T21:11:27+00:00
slug: documentos/no-tecnicos/cronica-de-una-reinstalacion-de-windows
---
<p>&iquest;Todav&iacute;a crees que Windows es m&aacute;s f&aacute;cil que Linux? Ser&aacute; porque nunca has instalado un Windows 2000 en tiempos del Blaster</p><p>Mi situaci&oacute;n era la siguiente: ten&iacute;a instalado un Windows 2000 talcual se prove&iacute;a: sin Service Packs ni otras actualizaciones, sinantivirus ni firewalls, ... y claro, se infect&oacute; con el <a href="http://www.vsantivirus.com/lovsan-a.htm">MSBlast.A</a>:el sistema no funcionaba ni hacia atr&aacute;s, y mis hermanas me exig&iacute;an queles dejara Windows listo antes de irme a la Universidad, se niegan aintentar Linux (con lo facilito que se lo puse: un usuario sincontrase&ntilde;a, con KDE, ... si casi parece Windows).</p><p>Comienzo a las 15:30.</p><p> Limpio el virus manualmente y reinicio.<br>Tarda una eternidad en cargar el explorer.exe<br>Compruebo que el sistema est&aacute; limpio... dentro de lo que cabe.<br>Bajo un antivirus y lo instalo. Reinicio.<br>Busco un parche para el bug en RpcSs que explota el MSBlast parapropagarse. Dice que necesito tener instalado los Service Packs parapoder instalarlo.<br>Me dirijo a Windows Update. Me dice que busca las actualizaciones ainstalar y todo eso. Encuentra unas cuantas (14), entre ellas elService Pack 4, que me dice que tiene que instalarse por separado. Ledigo que instale el SP4, entonces. Se produce un error en svchost.exe.El sistema se queda est&uacute;pido (con estúpido me refiero a que no abrealgunas páginas web, los iconos del Panel de Control no hacen nada,...). Reinicio.<br>Vuelvo a probar Windows Update. Se vuelve a cerrar svchost.exe y elsistema est&uacute;pido otra vez. Reinicio.<br>El virus debe de haber dejado fastidiado Windows, el svchost.exe y lamadre que los hizo a todos. Ser&aacute; mejor reinstalar Windows.<br>Leo un libro mientras se cargan los disquetes de instalación deWindows 2000.<br>Comienzo la reinstalaci&oacute;n de Windows.<br>Vaya, me da la posibilidad de reparar una instalación existente deWindows, voy a probar. Reinicio.<br>Contin&uacute;o con la reparaci&oacute;n. Reinicio.<br>P&eacute;rdida de tiempo: sigue tardando una eternidad en cargar explorer.exey el svchost.exe sigue fallando. Habr&aacute; que reinstalar. Reinicio.<br>Sigo leyendo el libro.<br>Comienza la reinstalaci&oacute;n. Reinicio.<br>Contin&uacute;o con la reinstalaci&oacute;n. Reinicio.<br>Concluyo la reinstalaci&oacute;n. Reinicio.<br>Parece que ya va.<br>Voy a Windows Update. Error en svchost.exe. Intento convencerme de queseguro que no es relevante. La cruel realidad me desenga&ntilde;a: el sistemase ha vuelto medio est&uacute;pido otra vez. Debe de ser el Windows Update loque hace fallar a svchost.exe, será mejor que baje los parchesmanualmente y los instale. Bajo los parches. Reinicio.<br>Me dice que no puedo ejecutar un antivirus mientras intento instalarun Service Pack. Cierro el antivirus. Al comenzar a ejecutar el parchese conecta a Internet, me infecto con el MSLaugh (<a href="http://www.vsantivirus.com/lovsan-e.htm">MSBlast.E</a>) yhace acto de presencia mi amigo el error de svchost.exe. El sistemaest&uacute;pido otra vez.<br>Leo en la p&aacute;gina web de Microsoft que los errores en svchost.exepueden ser producidos por peticiones malformadas en el puerto 135, elque usa MSBlast para propagarse. Deduzco que las infecciones conMSBlast y los errores en svchost.exe est&aacute;n relacionados.<br>Reinicio mientras veo que el bot&oacute;n de Reset va perdiendo su color azulintenso.<br>Sigo leyendo el libro.<br>Comienzo a reinstalar Windows. Reinicio.<br>Sigo reinstalando Windows. Reinicio.<br>Acabo de reinstalar Windows. Reinicio.<br>Recuerdo que Chaval Datafull había dicho un m&eacute;todo para desactivar elpuerto 135. Ese email lo tengo con todo mi correo en la partici&oacute;n deLinux y, aunque Linux lee particiones de Windows, Windows no leeparticiones de Linux. Reinicio y voy a Linux.<br>Copio el email a la partici&oacute;n de Windows. Reinicio.<br>Hago lo que Chaval dec&iacute;a en el email para cerrar el puerto. Reinicio.<br>El explorer.exe vuelve a tardar una eternidad en cargarse y el sistemase vuelve medio est&uacute;pido una vez m&aacute;s. Vuelvo a abrir el puerto.<br>Reinicio.<br>Parece que la &uacute;nica solución para evitar el MSBlast (ya que no puedoejecutar un antivirus mientras instalo Service Packs) y las peticionesen el puerto 135 que cuelgan al svchost.exe (ya que no puedo cerrarese puerto), ser&aacute; denegar a través de un firewall las peticiones a esepuerto. Si me conecto desde Windows para bajar el Zone Alarm coger&eacute; elvirus y se colgar&aacute; el svchost.exe, tengo que conectarme desde Linux.Reinicio.<br>Comienzo a bajar el Zone Alarm. 3.6 MB para mi conexi&oacute;n RTB (56Kbps).El servidor de Zone Labs va a una velocidad de v&eacute;rtigo de menos de 1KBps. Cuando llevo descargados 3.5 MB se corta la conexi&oacute;n. Elservidor de Zone Labs no acepta continuar la descarga desde donde secort&oacute;. Busco algún mirror FTP en <a href="http://www.alltheweb.com/?cat=ftp">AllTheWeb</a>, pero no hay ninguno,tengo que volver a descargarlo desde el principio.<br>Acabo de descargarlo. Lo copio a la partici&oacute;n de Windows. Reinicio.<br>Lo instalo. Reinicio con mi nuevo dedo azul.<br>&iquest;Tienen el descaro de llamarle firewall a esto? En fin, voy a WindowsUpdate. Se realiza otra vez todo el proceso. Le digo que me instale elService Pack. 500 KB, bueno, a esperar un rato.<br>Comienza la instalación. Dice que va a bajar todo lo que va a instalarel Service Pack. &iquest;Y por que no lo bajó cuando baj&oacute; los 500 KB? En fin,que baje.<br>Son 73 MB. Dice que va a tardar m&aacute;s de 1500 minutos en bajarlo. Echocuentas. &iexcl;&iexcl;&iexcl;M&aacute;s de 24 horas!!! De eso nada, mis hermanas se tendr&aacute;nque conformar con el firewall.</p><p>Son las 21:30.</p><p>En fin, dicen que Windows es mucho m&aacute;s f&aacute;cil que Linux...</p>
